# Задание №1
# import math_operations
# a = int(input('Введите 1 число: '))
# b = int(input('Введите 2 число: '))
# answer = input('Какую операцию желаете выполнить: ')
# if answer == 'Сложение':
#     summary = math_operations.summ(a,b)
#     print('Сумма: ', summary)
# elif answer == 'Разность':
#     razn = math_operations.raz(a,b)
#     print('Разность: ', razn)
# elif answer == 'Деление':
#     chast = math_operations.dell(a,b)
#     print('Частное: ', chast)
# elif answer == 'Умножение':
#     proiz = math_operations.umnoj(a,b)
#     print('Произведение: ', proiz)

# Задание №2
# import text_operations
# func = input('Какую функцию вы хотите использовать?' )
# text = input('Введите ваш текст: ')
# if func == 'Увеличение символов':
#     upper = text_operations.big_symbol(text)
#     print('Ваш текст:', upper)
# elif func == 'Уменьшение символов':
#     lower = text_operations.small_symbol(text)
#     print('Ваш текст:',lower)

# Задание №3
# class Student:
#     def init(name, age):
#         student_name = name
#         student_age = age
#         return student_name, student_age
#     def display_info(student_name, student_age):
#         print(f"Имя: {student_name}, Возраст: {student_age}")
#
# student1 = Student.init('Петя', 18)
#
# Student.display_info(*student1)
