# Приветствие по имени:
# your_name = input("Введите своё имя:")
# print(f"Добро Пожаловать,{your_name}!")

# Программа для подсчета средней оценки:
# a = int(input("Введите оценку: "))
# b = int(input("Введите оценку: "))
# c = int(input("Введите оценку: "))
# print(f"Среднее значение:{(a+b+c)/3}")


# Сравнение оценок:
# math = int(input("Математика(кол-во баллов из 10): "))
# math2 = int(input("Математика(кол-во баллов из 10): "))
# math3 = int(input("Математика(кол-во баллов из 10): "))
# math_all = ((math+math2+math3)//3)
# chem = int(input("Химия(кол-во баллов из 10): "))
# chem2 = int(input("Химия(кол-во баллов из 10): "))
# chem3 = int(input("Химия(кол-во баллов из 10): "))
# chem_all = ((chem+chem2+chem3)//3)
# phys = int(input("Физика(кол-во баллов из 10): "))
# phys2 = int(input("Физика(кол-во баллов из 10): "))
# phys3 = int(input("Физика(кол-во баллов из 10): "))
# phys_all = ((phys+phys2+phys3)//3)
# if math_all > chem_all and phys_all:
#     print(f"Предмет математика имеет высшее среднее значение:{math_all}")
# elif chem_all > phys_all and math_all:
#     print(f"Предмет химия имеет высшее среднее значение:{chem_all}")
# elif phys_all > chem_all and math_all:
#     print(f"Предмет физика имеет высшее среднее значение:{phys_all}")

# Карточка:
# last_name = input("Введите свою фамилию: ")
# name = input("Введите своё имя: ")
# patronymic = input("Введите своё отчество: ")
# date = input("Введите дату рождения(день,месяц,год): ")
# place = input("Введите место проживания: ")
# card = (f'''{last_name} {name} {patronymic}
#  {date}
#  {place}''')
# print('''Минуту, ваша карточка печатается
# ...
# ...
# ...
# ...''')
# print("Ваша карточка готова!:\n----------------------------------------------------------\n",card,"\n---------------------------------------------------------")


